---
kind: enumMember
id: F:Autodesk.Revit.UI.EditorInteractionType.KeepAlive
enum: Autodesk.Revit.UI.EditorInteractionType
source: html/5dba951f-9d86-4205-a829-be4df4ad200d.htm
---
# Autodesk.Revit.UI.EditorInteractionType.KeepAlive

Keeps the active editor alive during pane activation.
 This results in the current selection being kept active and available to the pane.
One example built-in dockable pane that uses this mode is the Revit Property Palette.